export interface PumpValues {
    pumpName: string;
    Q: string;
    QValue: number[];
    H: number[];
    engineName: string[];
    N: number[];
}

export const table: PumpValues[] = [
    {
        pumpName: 'Х2/25',
        Q: '4.2∙10⁻⁴',
        QValue: [1.51],
        H: [0, 25, 0],
        engineName: ['', 'AOЛ-12-2', ''],
        N: [0, 1.1, 0]
    },
    {
        pumpName: 'Х8/18',
        Q: '2.4∙10⁻³',
        QValue: [8.64],
        H: [11.3, 14.8, 18],
        engineName: ['АО2-31-2', '', 'ВАО-31-2'],
        N: [3, 0, 3]
    },
    {
        pumpName: 'Х8/30',
        Q: '2.4∙10⁻³',
        QValue: [8.64],
        H: [17.7, 24, 30],
        engineName: ['', 'АО2-32-2', ''],
        N: [0, 4, 0]
    },
    {
        pumpName: 'Х20/18',
        Q: '5.5∙10⁻³',
        QValue: [19.8],
        H: [10.5, 13.8, 18],
        engineName: ['АО2-31-2', '', 'ВАО-32-2'],
        N: [3, 0, 3]
    },
    {
        pumpName: 'X20/31',
        Q: '5.5∙10⁻³',
        QValue: [19.8],
        H: [18, 25, 31],
        engineName: ['АО2-41-2', '', 'ВАО-41-2'],
        N: [5.5, 0, 5.5]
    },
    {
        pumpName: 'Х20/53',
        Q: '5.5∙10⁻³',
        QValue: [19.8],
        H: [34.4, 44, 53],
        engineName: ['А02-52-2', '', 'ВАО-52-2'],
        N: [13, 0, 13]
    },
    {
        pumpName: 'Х45/21',
        Q: '1.25∙10⁻²',
        QValue: [45],
        H: [13.5, 17.3, 21],
        engineName: ['А0-51-2', '', 'ВАО-51-2'],
        N: [10, 0, 10]
    },
    {
        pumpName: 'Х45/31',
        Q: '1.25∙10⁻²',
        QValue: [45],
        H: [19.8, 25, 31],
        engineName: ['АО2-51-2', '', 'ВАО-51-2'],
        N: [13, 0, 13]
    },
    {
        pumpName: 'Х45/54',
        Q: '1.25∙10⁻²',
        QValue: [45],
        H: [32.6, 42, 54],
        engineName: ['АО2-62-2', 'АО2-71-2', 'ВАО-72-2'],
        N: [17, 22, 30]
    },
    {
        pumpName: 'Х90/19',
        Q: '2.5∙10⁻²',
        QValue: [90],
        H: [13, 16, 19],
        engineName: ['АО2-51-2', 'АО2-52-2', 'ВАО-62-2'],
        N: [10, 13, 17],
    },
    {
        pumpName: 'Х90/33',
        Q: '2.5∙10⁻²',
        QValue: [90],
        H: [25, 29.2, 33],
        engineName: ['АО2-62-2', 'АО2-71-2', 'А02-72-2'],
        N: [17, 22, 30],
    },
    {
        pumpName: 'Х90/49',
        Q: '2.5∙10⁻²',
        QValue: [90],
        H: [31.4, 40, 49],
        engineName: ['А02-71-2', 'А02-72-2', 'АО-81-2'],
        N: [22, 30, 40],
    },
    {
        pumpName: 'Х90/85',
        Q: '2.5∙10⁻²',
        QValue: [90],
        H: [56, 70, 85],
        engineName: ['А02-81-2', 'АО2-82-2', 'А02-91-2'],
        N: [40, 55, 75],
    },
    {
        pumpName: 'Х160/29/2',
        Q: '4.5∙10⁻²',
        QValue: [162],
        H: [20, 24, 29],
        engineName: ['ВАО-72-2', 'АО2-72-2', 'АО2-81-2'],
        N: [30, 30, 40],
    },
    {
        pumpName: 'X160/49/2',
        Q: '4.5∙10⁻²',
        QValue: [162],
        H: [33, 40.6, 49],
        engineName: ['АО2-81-2', 'АО2-82-2', 'АО2-91-2'],
        N: [40, 55, 75],
    },
    {
        pumpName: 'X160/29',
        Q: '4.5∙10⁻²',
        QValue: [162],
        H: [0, 29, 0],
        engineName: ['', 'АО2-81-4', ''],
        N: [0, 40, 0],
    },


]