export const variants: number[][] = [
    [
        5, //h
        45, //V
        0.1, //P
        20, //H
        20, //t1
        35, //Lн линия нагнетания
        2, //2 отвода под углом 90
        90, // угол отвода
        5, //5 отводов под углом 110
        110, // угол отвода
        2, // нормальных вентиля 
        1, // прямоточный вентиль
        15, //Lвс линия всасывания
        2, // прямоточных вентиля
        3, // отвода под углом 90
        90, // угол отвода
        4, // отношение радиуса изгиба к внутреннему диаметру трубопровода
        32.93, //полный напор насоса
        6.7, //Полезная мощность насоса
        153420, //Re
        0.0235, //Коэффициент трения
    ],
    [
    ]
]